In [3]:
import pandas as pd

In [6]:
data = pd.DataFrame({"Name": ['Rosita', 'Manut', 'Midnight','Teddy'],
                     "Animal": ["cat", "dog", "cat", "rabbit"],
                     "Age": [12,5,2,5]})

In [8]:
data.head()

       Name  Animal  Age
0    Rosita     cat   12
1     Manut     dog    5
2  Midnight     cat    2
3     Teddy  rabbit    5

In [12]:
addition = lambda x: x+2
addition(data['Age'])

0    14
1     7
2     4
3     7
Name: Age, dtype: int64

In [15]:
data['age_2'] = addition(data['Age'])

data

       Name  Animal  Age  age_2
0    Rosita     cat   12     14
1     Manut     dog    5      7
2  Midnight     cat    2      4
3     Teddy  rabbit    5      7

In [19]:
# Define the lambda function to label based on 'Animal'
data['color'] = data['Animal'].apply(
       lambda x: 'grey' if x == 'cat' else ('brown' if x == 'dog' else 'white'))

In [21]:
data.head()

       Name  Animal  Age  age_2  color
0    Rosita     cat   12     14   grey
1     Manut     dog    5      7  brown
2  Midnight     cat    2      4   grey
3     Teddy  rabbit    5      7  white